Revit 2027 API
Face.ComputeSecondDerivatives Method
Returns the second partial derivatives of the face at the specified point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FaceSecondDerivatives ComputeSecondDerivatives(
	UV point
)
Public Function ComputeSecondDerivatives (
	point As UV
) As FaceSecondDerivatives
public:
FaceSecondDerivatives^ ComputeSecondDerivatives(
	UV^ point
)
member ComputeSecondDerivatives :
        point : UV -> FaceSecondDerivatives
Parameters
point UV
The parameters to be evaluated, in natural parameterization of the face.
Return Value
FaceSecondDerivatives
The second partial derivatives of the face at the specified point.
Remarks
 It does not take the bounding edge loops into account.
See Also
Reference
Face Class
Autodesk.Revit.DB Namespace